zephyrproject-rtos/hal_infineon/aurix/tc3x/Sfr/TC39xB/IfxDam_reg.h
/** \brief 108, DAM Region Read Enable Register A */
#define DAM0_RGNACCEN3_RA /*lint --e(923, 9078)*/ (*(volatile Ifx_DAM_RGNACCEN_RA*)0xF8500108u)
/** Alias (User Manual Name) for DAM0_RGNACCEN3_RA.
* To use register names with standard convension, please use DAM0_RGNACCEN3_RA.
*/
#define DAM0_RGNACCENRA3 (DAM0_RGNACCEN3_RA)

/** \brief 10C, DAM Region Read Enable Register B */
#define DAM0_RGNACCEN3_RB /*lint --e(923, 9078)*/ (*(volatile Ifx_DAM_RGNACCEN_RB*)0xF850010Cu)
/** Alias (User Manual Name) for DAM0_RGNACCEN3_RB.
* To use register names with standard convension, please use DAM0_RGNACCEN3_RB.
*/
#define DAM0_RGNACCENRB3 (DAM0_RGNACCEN3_RB)

/** \brief 118, DAM Region Read Enable Register A */
#define DAM0_RGNACCEN4_RA /*lint --e(923, 9078)*/ (*(volatile Ifx_DAM_RGNACCEN_RA*)0xF8500118u)
/** Alias (User Manual Name) for DAM0_RGNACCEN4_RA.
* To use register names with standard convension, please use DAM0_RGNACCEN4_RA.
*/
#define DAM0_RGNACCENRA4 (DAM0_RGNACCEN4_RA)

/** \brief 11C, DAM Region Read Enable Register B */
#define DAM0_RGNACCEN4_RB /*lint --e(923, 9078)*/ (*(volatile Ifx_DAM_RGNACCEN_RB*)0xF850011Cu)
/** Alias (User Manual Name) for DAM0_RGNACCEN4_RB.
* To use register names with standard convension, please use DAM0_RGNACCEN4_RB.
*/
#define DAM0_RGNACCENRB4 (DAM0_RGNACCEN4_RB)

/** \brief 128, DAM Region Read Enable Register A */
#define DAM0_RGNACCEN5_RA /*lint --e(923, 9078)*/ (*(volatile Ifx_DAM_RGNACCEN_RA*)0xF8500128u)
/** Alias (User Manual Name) for DAM0_RGNACCEN5_RA.
* To use register names with standard convension, please use DAM0_RGNACCEN5_RA.
*/
#define DAM0_RGNACCENRA5 (DAM0_RGNACCEN5_RA)

/** \brief 12C, DAM Region Read Enable Register B */
#define DAM0_RGNACCEN5_RB /*lint --e(923, 9078)*/ (*(volatile Ifx_DAM_RGNACCEN_RB*)0xF850012Cu)
/** Alias (User Manual Name) for DAM0_RGNACCEN5_RB.
* To use register names with standard convension, please use DAM0_RGNACCEN5_RB.
*/
#define DAM0_RGNACCENRB5 (DAM0_RGNACCEN5_RB)

/** \brief 138, DAM Region Read Enable Register A */
#define DAM0_RGNACCEN6_RA /*lint --e(923, 9078)*/ (*(volatile Ifx_DAM_RGNACCEN_RA*)0xF8500138u)
/** Alias (User Manual Name) for DAM0_RGNACCEN6_RA.
* To use register names with standard convension, please use DAM0_RGNACCEN6_RA.
*/
#define DAM0_RGNACCENRA6 (DAM0_RGNACCEN6_RA)

/** \brief 13C, DAM Region Read Enable Register B */
#define DAM0_RGNACCEN6_RB /*lint --e(923, 9078)*/ (*(volatile Ifx_DAM_RGNACCEN_RB*)0xF850013Cu)
/** Alias (User Manual Name) for DAM0_RGNACCEN6_RB.
* To use register names with standard convension, please use DAM0_RGNACCEN6_RB.
*/
#define DAM0_RGNACCENRB6 (DAM0_RGNACCEN6_RB)

/** \brief 148, DAM Region Read Enable Register A */
#define DAM0_RGNACCEN7_RA /*lint --e(923, 9078)*/ (*(volatile Ifx_DAM_RGNACCEN_RA*)0xF8500148u)
/** Alias (User Manual Name) for DAM0_RGNACCEN7_RA.
* To use register names with standard convension, please use DAM0_RGNACCEN7_RA.
*/
#define DAM0_RGNACCENRA7 (DAM0_RGNACCEN7_RA)

/** \brief 14C, DAM Region Read Enable Register B */
#define DAM0_RGNACCEN7_RB /*lint --e(923, 9078)*/ (*(volatile Ifx_DAM_RGNACCEN_RB*)0xF850014Cu)
/** Alias (User Manual Name) for DAM0_RGNACCEN7_RB.
* To use register names with standard convension, please use DAM0_RGNACCEN7_RB.
*/
#define DAM0_RGNACCENRB7 (DAM0_RGNACCEN7_RB)

/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxSfr_Dam_Registers_Cfg_Dam1
 * \{  */
/** \brief 0, DAM Clock Control Register */
#define DAM1_CLC /*lint --e(923, 9078)*/ (*(volatile Ifx_DAM_CLC*)0xF8510000u)

/** \brief 8, DAM Module ID Register */
#define DAM1_MODID /*lint --e(923, 9078)*/ (*(volatile Ifx_DAM_MODID*)0xF8510008u)

/** \brief 10, DAM Access Enable Register 0 */
#define DAM1_ACCEN0 /*lint --e(923, 9078)*/ (*(volatile Ifx_DAM_ACCEN0*)0xF8510010u)

/** \brief 14, DAM Access Enable Register 1 */
#define DAM1_ACCEN1 /*lint --e(923, 9078)*/ (*(volatile Ifx_DAM_ACCEN1*)0xF8510014u)

/** \brief 20, DAM Memory Control Register */
#define DAM1_MEMCON /*lint --e(923, 9078)*/ (*(volatile Ifx_DAM_MEMCON*)0xF8510020u)

/** \brief 50, DAM Region Lower Address Register */
#define DAM1_RGN0_LA /*lint --e(923, 9078)*/ (*(volatile Ifx_DAM_RGN_LA*)0xF8510050u)
/** Alias (User Manual Name) for DAM1_RGN0_LA.
* To use register names with standard convension, please use DAM1_RGN0_LA.
*/
#define DAM1_RGNLA0 (DAM1_RGN0_LA)

/** \brief 54, DAM Region Upper Address Register */
#define DAM1_RGN0_UA /*lint --e(923, 9078)*/ (*(volatile Ifx_DAM_RGN_UA*)0xF8510054u)
/** Alias (User Manual Name) for DAM1_RGN0_UA.
* To use register names with standard convension, please use DAM1_RGN0_UA.
*/
#define DAM1_RGNUA0 (DAM1_RGN0_UA)

/** \brief 58, DAM Region Write Enable Register A */
#define DAM1_RGN0_ACCENA /*lint --e(923, 9078)*/ (*(volatile Ifx_DAM_RGN_ACCENA*)0xF8510058u)
/** Alias (User Manual Name) for DAM1_RGN0_ACCENA.
* To use register names with standard convension, please use DAM1_RGN0_ACCENA.
*/
#define DAM1_RGNACCENWA0 (DAM1_RGN0_ACCENA)

/** \brief 5C, DAM Region Write Enable Register B */
#define DAM1_RGN0_ACCENB /*lint --e(923, 9078)*/ (*(volatile Ifx_DAM_RGN_ACCENB*)0xF851005Cu)
/** Alias (User Manual Name) for DAM1_RGN0_ACCENB.
* To use register names with standard convension, please use DAM1_RGN0_ACCENB.
*/
#define DAM1_RGNACCENWB0 (DAM1_RGN0_ACCENB)

/** \brief 60, DAM Region Lower Address Register */
#define DAM1_RGN1_LA /*lint --e(923, 9078)*/ (*(volatile Ifx_DAM_RGN_LA*)0xF8510060u)
/** Alias (User Manual Name) for DAM1_RGN1_LA.
* To use register names with standard convension, please use DAM1_RGN1_LA.
*/
#define DAM1_RGNLA1 (DAM1_RGN1_LA)

/** \brief 64, DAM Region Upper Address Register */
#define DAM1_RGN1_UA /*lint --e(923, 9078)*/ (*(volatile Ifx_DAM_RGN_UA*)0xF8510064u)
/** Alias (User Manual Name) for DAM1_RGN1_UA.
* To use register names with standard convension, please use DAM1_RGN1_UA.
*/
#define DAM1_RGNUA1 (DAM1_RGN1_UA)

/** \brief 68, DAM Region Write Enable Register A */
#define DAM1_RGN1_ACCENA /*lint --e(923, 9078)*/ (*(volatile Ifx_DAM_RGN_ACCENA*)0xF8510068u)
/** Alias (User Manual Name) for DAM1_RGN1_ACCENA.
* To use register names with standard convension, please use DAM1_RGN1_ACCENA.
*/
#define DAM1_RGNACCENWA1 (DAM1_RGN1_ACCENA)

/** \brief 6C, DAM Region Write Enable Register B */
#define DAM1_RGN1_ACCENB /*lint --e(923, 9078)*/ (*(volatile Ifx_DAM_RGN_ACCENB*)0xF851006Cu)
/** Alias (User Manual Name) for DAM1_RGN1_ACCENB.
* To use register names with standard convension, please use DAM1_RGN1_ACCENB.
*/
#define DAM1_RGNACCENWB1 (DAM1_RGN1_ACCENB)

/** \brief 70, DAM Region Lower Address Register */
#define DAM1_RGN2_LA /*lint --e(923, 9078)*/ (*(volatile Ifx_DAM_RGN_LA*)0xF8510070u)
/** Alias (User Manual Name) for DAM1_RGN2_LA.
* To use register names with standard convension, please use DAM1_RGN2_LA.
*/
#define DAM1_RGNLA2 (DAM1_RGN2_LA)

/** \brief 74, DAM Region Upper Address Register */
#define DAM1_RGN2_UA /*lint --e(923, 9078)*/ (*(volatile Ifx_DAM_RGN_UA*)0xF8510074u)
/** Alias (User Manual Name) for DAM1_RGN2_UA.
* To use register names with standard convension, please use DAM1_RGN2_UA.
*/
#define DAM1_RGNUA2 (DAM1_RGN2_UA)

