zephyrproject-rtos/hal_infineon/aurix/tc3x/Sfr/TC39xB/IfxDam_reg.h
/** \brief 78, DAM Region Write Enable Register A */
#define DAM1_RGN2_ACCENA /*lint --e(923, 9078)*/ (*(volatile Ifx_DAM_RGN_ACCENA*)0xF8510078u)
/** Alias (User Manual Name) for DAM1_RGN2_ACCENA.
* To use register names with standard convension, please use DAM1_RGN2_ACCENA.
*/
#define DAM1_RGNACCENWA2 (DAM1_RGN2_ACCENA)

/** \brief 7C, DAM Region Write Enable Register B */
#define DAM1_RGN2_ACCENB /*lint --e(923, 9078)*/ (*(volatile Ifx_DAM_RGN_ACCENB*)0xF851007Cu)
/** Alias (User Manual Name) for DAM1_RGN2_ACCENB.
* To use register names with standard convension, please use DAM1_RGN2_ACCENB.
*/
#define DAM1_RGNACCENWB2 (DAM1_RGN2_ACCENB)

/** \brief 80, DAM Region Lower Address Register */
#define DAM1_RGN3_LA /*lint --e(923, 9078)*/ (*(volatile Ifx_DAM_RGN_LA*)0xF8510080u)
/** Alias (User Manual Name) for DAM1_RGN3_LA.
* To use register names with standard convension, please use DAM1_RGN3_LA.
*/
#define DAM1_RGNLA3 (DAM1_RGN3_LA)

/** \brief 84, DAM Region Upper Address Register */
#define DAM1_RGN3_UA /*lint --e(923, 9078)*/ (*(volatile Ifx_DAM_RGN_UA*)0xF8510084u)
/** Alias (User Manual Name) for DAM1_RGN3_UA.
* To use register names with standard convension, please use DAM1_RGN3_UA.
*/
#define DAM1_RGNUA3 (DAM1_RGN3_UA)

/** \brief 88, DAM Region Write Enable Register A */
#define DAM1_RGN3_ACCENA /*lint --e(923, 9078)*/ (*(volatile Ifx_DAM_RGN_ACCENA*)0xF8510088u)
/** Alias (User Manual Name) for DAM1_RGN3_ACCENA.
* To use register names with standard convension, please use DAM1_RGN3_ACCENA.
*/
#define DAM1_RGNACCENWA3 (DAM1_RGN3_ACCENA)

/** \brief 8C, DAM Region Write Enable Register B */
#define DAM1_RGN3_ACCENB /*lint --e(923, 9078)*/ (*(volatile Ifx_DAM_RGN_ACCENB*)0xF851008Cu)
/** Alias (User Manual Name) for DAM1_RGN3_ACCENB.
* To use register names with standard convension, please use DAM1_RGN3_ACCENB.
*/
#define DAM1_RGNACCENWB3 (DAM1_RGN3_ACCENB)

/** \brief 90, DAM Region Lower Address Register */
#define DAM1_RGN4_LA /*lint --e(923, 9078)*/ (*(volatile Ifx_DAM_RGN_LA*)0xF8510090u)
/** Alias (User Manual Name) for DAM1_RGN4_LA.
* To use register names with standard convension, please use DAM1_RGN4_LA.
*/
#define DAM1_RGNLA4 (DAM1_RGN4_LA)

/** \brief 94, DAM Region Upper Address Register */
#define DAM1_RGN4_UA /*lint --e(923, 9078)*/ (*(volatile Ifx_DAM_RGN_UA*)0xF8510094u)
/** Alias (User Manual Name) for DAM1_RGN4_UA.
* To use register names with standard convension, please use DAM1_RGN4_UA.
*/
#define DAM1_RGNUA4 (DAM1_RGN4_UA)

/** \brief 98, DAM Region Write Enable Register A */
#define DAM1_RGN4_ACCENA /*lint --e(923, 9078)*/ (*(volatile Ifx_DAM_RGN_ACCENA*)0xF8510098u)
/** Alias (User Manual Name) for DAM1_RGN4_ACCENA.
* To use register names with standard convension, please use DAM1_RGN4_ACCENA.
*/
#define DAM1_RGNACCENWA4 (DAM1_RGN4_ACCENA)

/** \brief 9C, DAM Region Write Enable Register B */
#define DAM1_RGN4_ACCENB /*lint --e(923, 9078)*/ (*(volatile Ifx_DAM_RGN_ACCENB*)0xF851009Cu)
/** Alias (User Manual Name) for DAM1_RGN4_ACCENB.
* To use register names with standard convension, please use DAM1_RGN4_ACCENB.
*/
#define DAM1_RGNACCENWB4 (DAM1_RGN4_ACCENB)

/** \brief A0, DAM Region Lower Address Register */
#define DAM1_RGN5_LA /*lint --e(923, 9078)*/ (*(volatile Ifx_DAM_RGN_LA*)0xF85100A0u)
/** Alias (User Manual Name) for DAM1_RGN5_LA.
* To use register names with standard convension, please use DAM1_RGN5_LA.
*/
#define DAM1_RGNLA5 (DAM1_RGN5_LA)

/** \brief A4, DAM Region Upper Address Register */
#define DAM1_RGN5_UA /*lint --e(923, 9078)*/ (*(volatile Ifx_DAM_RGN_UA*)0xF85100A4u)
/** Alias (User Manual Name) for DAM1_RGN5_UA.
* To use register names with standard convension, please use DAM1_RGN5_UA.
*/
#define DAM1_RGNUA5 (DAM1_RGN5_UA)

/** \brief A8, DAM Region Write Enable Register A */
#define DAM1_RGN5_ACCENA /*lint --e(923, 9078)*/ (*(volatile Ifx_DAM_RGN_ACCENA*)0xF85100A8u)
/** Alias (User Manual Name) for DAM1_RGN5_ACCENA.
* To use register names with standard convension, please use DAM1_RGN5_ACCENA.
*/
#define DAM1_RGNACCENWA5 (DAM1_RGN5_ACCENA)

/** \brief AC, DAM Region Write Enable Register B */
#define DAM1_RGN5_ACCENB /*lint --e(923, 9078)*/ (*(volatile Ifx_DAM_RGN_ACCENB*)0xF85100ACu)
/** Alias (User Manual Name) for DAM1_RGN5_ACCENB.
* To use register names with standard convension, please use DAM1_RGN5_ACCENB.
*/
#define DAM1_RGNACCENWB5 (DAM1_RGN5_ACCENB)

/** \brief B0, DAM Region Lower Address Register */
#define DAM1_RGN6_LA /*lint --e(923, 9078)*/ (*(volatile Ifx_DAM_RGN_LA*)0xF85100B0u)
/** Alias (User Manual Name) for DAM1_RGN6_LA.
* To use register names with standard convension, please use DAM1_RGN6_LA.
*/
#define DAM1_RGNLA6 (DAM1_RGN6_LA)

/** \brief B4, DAM Region Upper Address Register */
#define DAM1_RGN6_UA /*lint --e(923, 9078)*/ (*(volatile Ifx_DAM_RGN_UA*)0xF85100B4u)
/** Alias (User Manual Name) for DAM1_RGN6_UA.
* To use register names with standard convension, please use DAM1_RGN6_UA.
*/
#define DAM1_RGNUA6 (DAM1_RGN6_UA)

/** \brief B8, DAM Region Write Enable Register A */
#define DAM1_RGN6_ACCENA /*lint --e(923, 9078)*/ (*(volatile Ifx_DAM_RGN_ACCENA*)0xF85100B8u)
/** Alias (User Manual Name) for DAM1_RGN6_ACCENA.
* To use register names with standard convension, please use DAM1_RGN6_ACCENA.
*/
#define DAM1_RGNACCENWA6 (DAM1_RGN6_ACCENA)

/** \brief BC, DAM Region Write Enable Register B */
#define DAM1_RGN6_ACCENB /*lint --e(923, 9078)*/ (*(volatile Ifx_DAM_RGN_ACCENB*)0xF85100BCu)
/** Alias (User Manual Name) for DAM1_RGN6_ACCENB.
* To use register names with standard convension, please use DAM1_RGN6_ACCENB.
*/
#define DAM1_RGNACCENWB6 (DAM1_RGN6_ACCENB)

/** \brief C0, DAM Region Lower Address Register */
#define DAM1_RGN7_LA /*lint --e(923, 9078)*/ (*(volatile Ifx_DAM_RGN_LA*)0xF85100C0u)
/** Alias (User Manual Name) for DAM1_RGN7_LA.
* To use register names with standard convension, please use DAM1_RGN7_LA.
*/
#define DAM1_RGNLA7 (DAM1_RGN7_LA)

/** \brief C4, DAM Region Upper Address Register */
#define DAM1_RGN7_UA /*lint --e(923, 9078)*/ (*(volatile Ifx_DAM_RGN_UA*)0xF85100C4u)
/** Alias (User Manual Name) for DAM1_RGN7_UA.
* To use register names with standard convension, please use DAM1_RGN7_UA.
*/
#define DAM1_RGNUA7 (DAM1_RGN7_UA)

/** \brief C8, DAM Region Write Enable Register A */
#define DAM1_RGN7_ACCENA /*lint --e(923, 9078)*/ (*(volatile Ifx_DAM_RGN_ACCENA*)0xF85100C8u)
/** Alias (User Manual Name) for DAM1_RGN7_ACCENA.
* To use register names with standard convension, please use DAM1_RGN7_ACCENA.
*/
#define DAM1_RGNACCENWA7 (DAM1_RGN7_ACCENA)

/** \brief CC, DAM Region Write Enable Register B */
#define DAM1_RGN7_ACCENB /*lint --e(923, 9078)*/ (*(volatile Ifx_DAM_RGN_ACCENB*)0xF85100CCu)
/** Alias (User Manual Name) for DAM1_RGN7_ACCENB.
* To use register names with standard convension, please use DAM1_RGN7_ACCENB.
*/
#define DAM1_RGNACCENWB7 (DAM1_RGN7_ACCENB)

/** \brief D8, DAM Region Read Enable Register A */
#define DAM1_RGNACCEN0_RA /*lint --e(923, 9078)*/ (*(volatile Ifx_DAM_RGNACCEN_RA*)0xF85100D8u)
/** Alias (User Manual Name) for DAM1_RGNACCEN0_RA.
* To use register names with standard convension, please use DAM1_RGNACCEN0_RA.
*/
#define DAM1_RGNACCENRA0 (DAM1_RGNACCEN0_RA)

/** \brief DC, DAM Region Read Enable Register B */
#define DAM1_RGNACCEN0_RB /*lint --e(923, 9078)*/ (*(volatile Ifx_DAM_RGNACCEN_RB*)0xF85100DCu)
/** Alias (User Manual Name) for DAM1_RGNACCEN0_RB.
* To use register names with standard convension, please use DAM1_RGNACCEN0_RB.
*/
#define DAM1_RGNACCENRB0 (DAM1_RGNACCEN0_RB)

/** \brief E8, DAM Region Read Enable Register A */
#define DAM1_RGNACCEN1_RA /*lint --e(923, 9078)*/ (*(volatile Ifx_DAM_RGNACCEN_RA*)0xF85100E8u)
/** Alias (User Manual Name) for DAM1_RGNACCEN1_RA.
* To use register names with standard convension, please use DAM1_RGNACCEN1_RA.
*/
#define DAM1_RGNACCENRA1 (DAM1_RGNACCEN1_RA)

/** \brief EC, DAM Region Read Enable Register B */
#define DAM1_RGNACCEN1_RB /*lint --e(923, 9078)*/ (*(volatile Ifx_DAM_RGNACCEN_RB*)0xF85100ECu)
/** Alias (User Manual Name) for DAM1_RGNACCEN1_RB.
* To use register names with standard convension, please use DAM1_RGNACCEN1_RB.
*/
#define DAM1_RGNACCENRB1 (DAM1_RGNACCEN1_RB)

/** \brief F8, DAM Region Read Enable Register A */
#define DAM1_RGNACCEN2_RA /*lint --e(923, 9078)*/ (*(volatile Ifx_DAM_RGNACCEN_RA*)0xF85100F8u)
/** Alias (User Manual Name) for DAM1_RGNACCEN2_RA.
* To use register names with standard convension, please use DAM1_RGNACCEN2_RA.
*/
#define DAM1_RGNACCENRA2 (DAM1_RGNACCEN2_RA)

/** \brief FC, DAM Region Read Enable Register B */
#define DAM1_RGNACCEN2_RB /*lint --e(923, 9078)*/ (*(volatile Ifx_DAM_RGNACCEN_RB*)0xF85100FCu)
/** Alias (User Manual Name) for DAM1_RGNACCEN2_RB.
* To use register names with standard convension, please use DAM1_RGNACCEN2_RB.
*/
#define DAM1_RGNACCENRB2 (DAM1_RGNACCEN2_RB)

