zephyrproject-rtos/hal_infineon/aurix/tc3x/Sfr/TC39xB/IfxDam_reg.h
/** \brief 108, DAM Region Read Enable Register A */
#define DAM1_RGNACCEN3_RA /*lint --e(923, 9078)*/ (*(volatile Ifx_DAM_RGNACCEN_RA*)0xF8510108u)
/** Alias (User Manual Name) for DAM1_RGNACCEN3_RA.
* To use register names with standard convension, please use DAM1_RGNACCEN3_RA.
*/
#define DAM1_RGNACCENRA3 (DAM1_RGNACCEN3_RA)

/** \brief 10C, DAM Region Read Enable Register B */
#define DAM1_RGNACCEN3_RB /*lint --e(923, 9078)*/ (*(volatile Ifx_DAM_RGNACCEN_RB*)0xF851010Cu)
/** Alias (User Manual Name) for DAM1_RGNACCEN3_RB.
* To use register names with standard convension, please use DAM1_RGNACCEN3_RB.
*/
#define DAM1_RGNACCENRB3 (DAM1_RGNACCEN3_RB)

/** \brief 118, DAM Region Read Enable Register A */
#define DAM1_RGNACCEN4_RA /*lint --e(923, 9078)*/ (*(volatile Ifx_DAM_RGNACCEN_RA*)0xF8510118u)
/** Alias (User Manual Name) for DAM1_RGNACCEN4_RA.
* To use register names with standard convension, please use DAM1_RGNACCEN4_RA.
*/
#define DAM1_RGNACCENRA4 (DAM1_RGNACCEN4_RA)

/** \brief 11C, DAM Region Read Enable Register B */
#define DAM1_RGNACCEN4_RB /*lint --e(923, 9078)*/ (*(volatile Ifx_DAM_RGNACCEN_RB*)0xF851011Cu)
/** Alias (User Manual Name) for DAM1_RGNACCEN4_RB.
* To use register names with standard convension, please use DAM1_RGNACCEN4_RB.
*/
#define DAM1_RGNACCENRB4 (DAM1_RGNACCEN4_RB)

/** \brief 128, DAM Region Read Enable Register A */
#define DAM1_RGNACCEN5_RA /*lint --e(923, 9078)*/ (*(volatile Ifx_DAM_RGNACCEN_RA*)0xF8510128u)
/** Alias (User Manual Name) for DAM1_RGNACCEN5_RA.
* To use register names with standard convension, please use DAM1_RGNACCEN5_RA.
*/
#define DAM1_RGNACCENRA5 (DAM1_RGNACCEN5_RA)

/** \brief 12C, DAM Region Read Enable Register B */
#define DAM1_RGNACCEN5_RB /*lint --e(923, 9078)*/ (*(volatile Ifx_DAM_RGNACCEN_RB*)0xF851012Cu)
/** Alias (User Manual Name) for DAM1_RGNACCEN5_RB.
* To use register names with standard convension, please use DAM1_RGNACCEN5_RB.
*/
#define DAM1_RGNACCENRB5 (DAM1_RGNACCEN5_RB)

/** \brief 138, DAM Region Read Enable Register A */
#define DAM1_RGNACCEN6_RA /*lint --e(923, 9078)*/ (*(volatile Ifx_DAM_RGNACCEN_RA*)0xF8510138u)
/** Alias (User Manual Name) for DAM1_RGNACCEN6_RA.
* To use register names with standard convension, please use DAM1_RGNACCEN6_RA.
*/
#define DAM1_RGNACCENRA6 (DAM1_RGNACCEN6_RA)

/** \brief 13C, DAM Region Read Enable Register B */
#define DAM1_RGNACCEN6_RB /*lint --e(923, 9078)*/ (*(volatile Ifx_DAM_RGNACCEN_RB*)0xF851013Cu)
/** Alias (User Manual Name) for DAM1_RGNACCEN6_RB.
* To use register names with standard convension, please use DAM1_RGNACCEN6_RB.
*/
#define DAM1_RGNACCENRB6 (DAM1_RGNACCEN6_RB)

/** \brief 148, DAM Region Read Enable Register A */
#define DAM1_RGNACCEN7_RA /*lint --e(923, 9078)*/ (*(volatile Ifx_DAM_RGNACCEN_RA*)0xF8510148u)
/** Alias (User Manual Name) for DAM1_RGNACCEN7_RA.
* To use register names with standard convension, please use DAM1_RGNACCEN7_RA.
*/
#define DAM1_RGNACCENRA7 (DAM1_RGNACCEN7_RA)

/** \brief 14C, DAM Region Read Enable Register B */
#define DAM1_RGNACCEN7_RB /*lint --e(923, 9078)*/ (*(volatile Ifx_DAM_RGNACCEN_RB*)0xF851014Cu)
/** Alias (User Manual Name) for DAM1_RGNACCEN7_RB.
* To use register names with standard convension, please use DAM1_RGNACCEN7_RB.
*/
#define DAM1_RGNACCENRB7 (DAM1_RGNACCEN7_RB)


/** \}  */

/******************************************************************************/

/******************************************************************************/

#endif /* IFXDAM_REG_H */
